{
    "agent_rules": "When updating, first check for an existing entry with the same category and today's date. If one is found, append new changes to its 'changes' array. Otherwise, create a new object at the top of the 'changelog' array. Each object requires a 'category', a 'date' (YYYY-MM-DD), and a 'changes' array with descriptive, full-sentence strings. Use 'General' category for project-wide or uncategorized changes.",
    "note_to_self_release_process": "To release a new version: 1. Commit and push all changes to main. 2. Create and push a git tag (eg. `git tag vX.Y.Z` then `git push origin vX.Y.Z`). 3. Go to GitHub Releases, draft a new release from the tag, copy/draft changelog notes, and publish.",
    "categories": ["General"],
    "changelog": [
      {
        "category": "General",
        "date": "2025-07-21",
        "version": "0.6.5",
        "changes": [
          "Fixed run_voice_typing.bat file having Unix line endings in the repository, which could cause issues on Windows systems when downloaded directly from GitHub. Thanks to @Theo-Deffenbaugh for reporting this issue.",
          "Added .gitattributes file to ensure batch files always maintain Windows line endings (CRLF) in the repository, preventing future line ending issues."
        ]
      },
      {
        "category": "General",
        "date": "2025-07-17",
        "version": "0.6.4",
        "changes": [
          "Added a 'mini' UI mode for a more compact recording indicator, configurable via tray settings and the new `ui_indicator_size` setting in `settings.json`.",
          "Added `top-center` and `bottom-center` UI indicator positions and applied an offset to bottom positions to prevent being obscured by the taskbar.",
          "Reorganized the 'Recording Indicator' tray menu to group size and position settings for better usability."
        ]
      },
      {
        "category": "General",
        "date": "2025-07-17",
        "version": "0.6.3",
        "changes": [
          "Fixed Python version compatibility checks in setup.bat and documentation to explicitly require Python 3.10-3.12, addressing Pillow wheel availability issue reported by @Theo-Deffenbaugh.",
          "Fixed the retry transcription functionality to remain available even after successful transcriptions, allowing users to retry when transcription results are inaccurate.",
          "The retry button now stays enabled until a new recording is started, enabling multiple retry attempts for the same audio."
        ]
      },
      {
        "category": "General",
        "date": "2025-07-08",
        "version": "0.6.2",
        "changes": [
          "Improved application restart reliability by using `subprocess.Popen` to preserve the virtual environment context.",
          "Fixed the silent-start timeout feature to correctly respect user settings.",
          "Added a 'Fine-Tuning' section to the README to document advanced user-configurable settings.",
          "Attempted fix for issue with native caps lock functionality being activated randomly.",
          "Implemented automatic log file cleanup with a configurable `log_retention_days` setting to manage disk space."
        ]
      },
      {
        "category": "General",
        "date": "2025-06-23",
        "version": "0.6.1",
        "changes": [
          "Implemented a temporary workaround to fix transcription cut-off issues with OpenAI's gpt-4o models by padding audio with a short silence."
        ]
      },
      {
        "category": "General",
        "date": "2025-06-22",
        "version": "0.6.1",
        "changes": [
          "Enhanced microphone handling to log the active recording device on startup and selection, and fixed a sync issue between settings and the tray menu display.",
          "Fixed a Unicode encoding error in console logging on Windows to correctly display emoji characters.",
          "Refactored logging setup into a dedicated `modules/logger.py` file for improved code organization.",
          "Refined transcription logging for clarity by consolidating provider/model details and adding a preview of the transcribed text upon completion.",
          "Fixed UI indicator positioning to correctly align on the primary monitor in multi-display setups.",
          "Added a 'UI Indicator Position' setting to the tray menu, allowing users to select a corner for the indicator.",
          "Added configurable `silence_threshold` in `settings.json` to fix transcription issue#2.",
          "Added a `Troubleshooting` section to README.md for the new setting.",
          "Improved logging by including RMS values on discarded audio and fixing `.pyw` output."
        ]
      },
      {
        "category": "General",
        "date": "2025-06-22",
        "version": "0.6.0",
        "changes": [
          "Renamed 'Auto-Stop on Silence' setting to 'Silent-Start Timeout' for clarity and added an automatic migration for existing user settings.",
          "Updated README.md with new information and added a migration guide."
        ]
      },
      {
        "category": "General",
        "date": "2025-06-21",
        "version": "0.6.0",
        "changes": [
          "🎉 Implemented multi-provider Speech-to-Text framework with support for OpenAI's new GPT-4o Transcribe models.",
          "Added provider selection in the tray menu under Settings → Speech-to-Text → Provider.",
          "Added model selection for OpenAI STT with Whisper, GPT-4o, and GPT-4o Mini options.",
          "Implemented Strategy and Factory patterns for flexible STT provider architecture, making it easy to add new providers.",
          "Updated default transcription model from Whisper to GPT-4o Mini for improved accuracy and lower cost.",
          "Added placeholder implementation for Google Cloud STT provider for future expansion."
        ]
      },
      {
        "category": "General",
        "date": "2025-06-18",
        "version": "0.5.4",
        "changes": [
          "Enhanced transcription UI with granular feedback for 'Transcribing' and 'Cleaning' stages, and allowed cancellation during these new phases.",
          "Improved transcription robustness by falling back to the original text if AI cleaning fails, with a UI warning to notify the user.",
          "Added a configurable `cleaning_timeout` to settings and fixed a potential crash by adding the `tenacity` dependency."
        ]
      },
      {
        "category": "General",
        "date": "2025-06-10",
        "version": "0.5.3",
        "changes": [
          "Implemented API timeouts for transcription (Whisper) and text cleaning (LiteLLM) to prevent the application from hanging during processing.",
          "Added improved user feedback on timeout errors with clear messaging and retry functionality."
        ]
      },
      {
        "category": "General",
        "date": "2025-03-21",
        "version": "0.5.2",
        "changes": [
          "Added `run_voice_typing.bat` for easier application launching.",
          "Tested and improved update process where users run `setup.bat` and choose 'Y' to check for updates.",
          "Refined text cleaning prompt for better transcription cleaning on smaller models."
        ]
      },
      {
        "category": "General",
        "date": "2025-03-21",
        "version": "0.5.1",
        "changes": [
          "Added version tracking and changelog.",
          "Simplified setup to only require an OpenAI API key for full functionality.",
          "Migrated to LiteLLM for multi-provider/model support for text cleaning.",
          "Fixed an issue with `settings.json` initialization and handling.",
          "Improved the `setup.bat` script with better error handling."
        ]
      }
    ]
  }